In [23]:
import pandas as pd 
import numpy as np
import mysql.connector as conn

In [24]:
DB = conn.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225',
database= 'employees'    
)

In [4]:
cursor = DB.cursor()

In [5]:
cursor.execute('SHOW TABLES')

In [6]:
for x in cursor:
    print(x)

('current_dept_emp',)
('departments',)
('dept_emp',)
('dept_emp_latest_date',)
('dept_manager',)
('employees',)
('salaries',)
('titles',)

In [9]:
query = 'SELECT COUNT(DISTINCT salary) FROM salaries'

In [10]:
cursor.execute(query)

In [11]:
for y in cursor:
    print(y)

(77290,)

In [12]:
query1 = 'SELECT AVG(salary) AS Avg_Salary FROM salaries;'

In [13]:
cursor.execute(query1)

In [14]:
for v in cursor:
    print(v)

(Decimal('63761.2043'),)

In [25]:
data = pd.read_sql_query('SELECT *FROM salaries',DB)

In [26]:
data.head(6)

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25
5   10001   71046  1991-06-25  1992-06-24

In [28]:
data['salary'].max()

## 63761.2043

158220

In [34]:
 add = data[data['salary'] == 60117]

In [39]:
values = add[['emp_no','to_date','salary']]
values

        emp_no     to_date  salary
0        10001  1987-06-26   60117
6190     10650  1998-10-03   60117
29225    13063  1996-01-02   60117
59986    16317  1998-09-10   60117
105661   21136  1997-03-09   60117
157290   26560  1996-03-05   60117
209539   32033  2000-12-23   60117
270683   38533  1995-11-16   60117
297517   41345  1996-01-02   60117
351915   47125  1999-05-01   60117
358545   47823  1998-05-30   60117
414154   53601  1994-06-20   60117
445108   56893  2000-05-07   60117
492972   61905  1996-07-18   60117
495749   62198  9999-01-01   60117
578567   70907  1996-12-01   60117
606715   73897  1999-08-12   60117
654795   78958  1991-02-06   60117
751578   89123  2001-12-18   60117
939552  108892  2000-04-29   60117

In [40]:
values.loc[939552]

emp_no         108892
to_date    2000-04-29
salary          60117
Name: 939552, dtype: object

In [41]:
df = pd.read_sql_query('SELECT *FROM employees',DB)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30
300024  999903  1977-09-14  Johnathan     Creek      M  1999-01-01

[300025 rows x 6 columns]